{
  "help": "The 'help' command shows the description of a given command. Used without a parameter, the command shows a list of all available commands.",
  "next": "The 'next' command ends the current entity's turn, moving to the next entity in the initiative order. It takes no parameters.",
  "end": "The 'end' command ends the program. It takes no parameters.",
  "roll": "The 'roll' command rolls dice in three different ways. If the first parameter is 'attack', the command rolls an attack roll with the second parameter as the to-hit modifier and the third parameter as the damage dice. If the first parameter is 'save', the commnand rolls a saving throw with the second parameter as the saving throw modifier and the third parameter as the DC. If neither 'attack' nor 'save' is present as the first parameter, the command rolls the dice amount, adding any specified modifiers.",
  "damage": "The 'damage' command inflicts damage to the specified entity equal to the amount given. If no entity is specified, the damage is done to the current entity in the initiative order. If a dice amount is given instead of a number, the dice is rolled and the result taken instead.",
  "heal": "The 'heal' command restores hit points to the specified entity equal to the amount given. If no entity is specified, the healing is done to the current entity in the initiative order. If a dice amount is given instead of a number, the dice is rolled and the result taken instead.",
  "remove": "The 'remove' command removes a given entity (by index in initiative order) from the initiative order. Used without a parameter, the command removes the current entity from the order.",
  "action": "The 'action' command executes a given action from the current entity's statistics, rolling all relevant to-hit and damage rolls and printing all extra traits' descriptions. Used without a parameter, the command shows a list of the current entity's available actions.",
  "save": "The 'save' command rolls a saving throw using the current entity's statistics. The first parameter is the ability to use (STR, CON, etc.) and the second (optional) parameter is the DC to save against.",
  "check": "The 'check' command rolls a skill or ability check using the current entity's statistics. The parameter is the skill or ability to use (athletics, WIS, etc.).",
  "rest": "The 'rest' command triggers the relevant effects for a rest, short or long as dictated by the parameter."
}
